# ------------------------------------------------------------------------------
# 22 quiz.
# ------------------------------------------------------------------------------
# 1번
# a.append(40)과 같은 동작.
# a.insert(len(a), 40)
# a[len(a):] = [40]

# 3번
# 리스트 a의 모든 요소 출력하는 코드

# a=[1,2,3,4,5]
# for i in range(len(a)):
#     print(a[i])

# i=0
# while i < len(a):
#     print(a[i])
#     i += 1

# for i in a:
#     print(i)

# 5번
# [0, 1, 2, 3, 17, 18, 19]를 만드는 코드

# a=[i for i in range(20) if i <=3 or i >=17]
# print(a)

# 6번
# [4.7, 3.5, 2.9] -> 문자열로 변환, 리스트가 되어야함.

a = list(map(str, [4.7, 3.5, 2.9]))
print(a)