# ------------------------------------------------------------------------------
# 제어문 - while 반복문
## [실습] 구구단 3단 출력하기. 단, while문 사용
# ------------------------------------------------------------------------------

# cnt=1

# print('3단')
# while cnt<10:
#     print(f'{3} * {cnt} = {3*cnt}')
#     cnt=cnt+1
# print('End')

# ------------------------------------------------------------------------------
## [실습] 1 ~ 30 범위의 수 중에서 홀수만 출력
##        단, while 문 사용
# ------------------------------------------------------------------------------
## [1] 1 ~ 30 숫자 while문으로 출력

# cnt=1
# while cnt<31:
#     print(cnt)
#     cnt=cnt+1

# cnt=1
# while cnt<31:
#     if cnt%2:
#         print(cnt)
#     cnt=cnt+1

cnt=1
while cnt<30:
    print(cnt)
    cnt=cnt+2