# -----------------------------------------------------------------------------
# 함수(Function) 이해 및 활용
# -----------------------------------------------------------------------------
# 함수기능 : 3개의 정수를 덧셈한 후 결과를 반환하는 함수
# 함수이름 : add3
# 매개변수 : num1, num2, num3
# 함수결과 : 정수 result
# -----------------------------------------------------------------------------
def add3(num1, num2, num3):
    result=num1+num2+num3
    return result


# -----------------------------------------------------------------------------
# 함수기능 : 3개의 정수를 곱셈한 후 결과를 반환하는 함수
# 함수이름 : mlt3
# 매개변수 : num1, num2, num3
# 함수결과 : 정수 result
# -----------------------------------------------------------------------------
def mlt3(num1, num2, num3):
    result=num1*num2*num3
    return result

# -----------------------------------------------------------------------------
# 함수기능 : 2개의 정수를 나눗셈한 후 결과를 반환하는 함수
# 함수이름 : div
# 매개변수 : num1, num2
# 함수결과 : 실수 result, None
# -----------------------------------------------------------------------------

def div(num1, num2):
    if num2:
        result=num1/num2
    else:
        print(f'{num2}으로는 {num1}을 나눌 수 없습니다.')

## 함수 사용하기 즉, 호출 ----------------------------------------------
## 덧셈하기
value=add3(1, 2, 3)

## 나눗셈하기
value1=div(3, 4)

print(value1)