# ------------------------------------------------------------------------------
# Dict 자료형 살펴보기
# - 여러가지 데이터를 dict 타입으로 저장
# ------------------------------------------------------------------------------
# [다양한 종류의 키]
## 키가 여러개 정보 합쳐서 사용할 경우 tuple 타입

person={'age':20, ('홍길동', 2000):100}

## 3명 정보 저장
p1 = {'name':'홍길동', 'age':20, 'job':'학생'}
p2 = {'name':'김철수', 'age':30, 'job':'회사원'}
p3 = {'name':'마징가', 'age':35, 'job':'영웅'}
p4 = {'name':'홍길동', 'age':15, 'job':'학생'}

persons=[p1,p2,p3,p4]
persons[0]['name']

# - 키 : 나이
persons2={20:{'name':'홍길동', 'job':'학생'},
          30:{'name':'김철수', 'job':'회사원'},
          35:{'name':'마징가', 'job':'영웅'},
          15:{'name':'홍길동', 'job':'학생'}}

print(persons2[35])

# - 키 : 이름과 나이
persons3={('홍길동', 20): {'job':'학생'},
          ('김철수', 30): {'job':'회사원'},
          ('마징가', 35): {'job':'영웅'},
          ('홍길동', 15): {'job':'학생'}
}

print(persons3[('김철수', 30)])
# print(persons3['김철수'])
