# ------------------------------------------------------------------------------
# unit.16
# ------------------------------------------------------------------------------
# for & range

# unit.16.1
# for와 range 사용하기
# for i in range(100):
#     print('Hello, world!')

# unit.16.1.1 반복문에서 변수의 변화 알아보기
# for i in range(100):
#     print('Hello, world!', i)

# ------------------------------------------------------------------------------
## quiz
# 2번
# for i in reversed(range(10, 20)):
#     print(i)

# ------------------------------------------------------------------------------
# 연습문제 : 리스트의 요소에 10을 곱해서 출력하기
# x=[49, -17, 25, 102, 8, 62, 21]

# # for i in range(len(x)):
# #     print(x[i]*10, end=" ")

# for i in x:
#     print(i * 10, end=" ")
# ------------------------------------------------------------------------------
# 심사문제 : 구구단 출력하기 (input()에서 안내 문자열은 출력하지 않음)
# 출력형식 : 숫자 * 숫자 = 숫자

dan=int(input(''))
for i in range(1,10):
    print(f'{dan} * {i} = {dan*i}')