# ------------------------------------------------------------------------------
# 14장 quiz (if-else)
# ------------------------------------------------------------------------------
# 02

# if x >= 10:
# print('x에 들어있는 값은') # 들여쓰기 오류
#     print('10 이상입니다.')
# else # : 누락
#     print('x에 들어있는 값은')
#     print('10 미만입니다.')

# 03
if not '':
    print(True)
else:
    print(False)
# 정답: True

# 04
# 정답: b,e
# b: if x == 10 or y == 20:
# e: if x and y:

# 05
x = 5

if x % 2 == 0:
    print('짝수')
else:
    print('홀수')

# ------------------------------------------------------------------------------
# 연습문제 : 합격 여부 판단하기

written_test = 75
coding_test = True

if written_test>=80 and coding_test==True:
    print('합격')
else:
    print('불합격')
# ------------------------------------------------------------------------------
# 심사문제 : 합격 여부 판단하기
# 국어, 영어, 수학, 과학 점수 입력
# 네 과목 평균 점수가 80점 이상일 때 합격
# 단, 점수는 0점 ~ 100점 사이 입력받고, 범위 벗어나는 경우 '잘못된 점수' 출력
# ex) 89 72 93 82
# >>> 합격
# ex2) 100 79 68 71
# >>> 불합격
# ------------------------------------------------------------------------------
kor=int(input('국어점수를 입력하세요.'))
eng=int(input('영어점수를 입력하세요.'))
math=int(input('수학점수를 입력하세요.'))
sci=int(input('과학점수를 입력하세요.'))


avg=(kor+eng+math+sci)/4
if avg >= 80:
    print('합격')
else:
    print('불합격')

# 0<=int(nums[0])<=100
# int(nums[0]) in range(101)

# str 점수 4개 리스트
jumsu =input().split()

jumsu =list(map(int, jumsu))
if (0<=int(jumsu[0])<=100) and (0<=int(jumsu[1])<=100) and (0<=int(jumsu[2])<=100) and (0<=int(jumsu[3])<=100):
    # 평균 = 합계/4
    if (sum(jumsu)/len(jumsu))>=80:
        print('합격')
    else:
        print('불합격')
else:
    print('잘못된 점수')