# ------------------------------------------------------------------------------
# 심사문제 : 교통카드 잔액 출력하기
# ------------------------------------------------------------------------------
# 표준 입력으로 금액(정수) 입력.
# 1회당 요금은 1350원
# 단, 최초 금액은 출력하지 않아야함.
# 잔액은 음수가 될 수 없으며, 잔액이 부족시 출력 끝냄.

# ex) 10000
# 8650
# 7300
# 5950
# 4600
# 3250
# 1900
# 550
# ------------------------------------------------------------------------------

cardcash=int(input(":"))
spend=1350

while cardcash >= 0:
    cardcash=cardcash-spend
    if cardcash < 0:
        break
    print(cardcash)